/******************** (C) COPYRIGHT 2017  **********************************
*Copyright(c)2017,杭州维勘科技有限公司
*All rights reserved
*
*文件名称：delay.c
*文件标识：
*摘    要：systick 延时配置、设定			 
*当前版本：1.0
*作    者：李华兵
*完成日期：2017/2/9
*****************************************************************************/
#include "delay.h"
#include "stm32f10x.h"

/*******************************************************************************
*函数名称：delay_clockint
*函数说明：配置SysTick
*输入参数：无
*输出参数：无
*返回参数：无 
*******************************************************************************/
void delay_clockint(void)
{
	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);
}

/*******************************************************************************
*函数名称：delay_us
*函数说明：延时，us为单位
*输入参数：时间 time 
*输出参数：无
*返回参数：无 
*******************************************************************************/
void delay_us(u32 time)
{
	u32 temp;	    	 
	SysTick->LOAD = 72 / 8 * time;  // 72M时钟频率 8分频  		 
	SysTick->VAL = 0x00;        //清空计数器
	SysTick->CTRL = 0x01 ;      //开始倒数

	do
	{
		temp = SysTick->CTRL;
	}
	while (temp&0x01 && !(temp&(1<<16)));//等待时间到达		
	
	SysTick->CTRL = 0x00;       //关闭计数器
	SysTick->VAL = 0X00;       //清空计数器	
}

/*******************************************************************************
*函数名称：delay_ms
*函数说明：延时，ms为单位
*输入参数：时间 time 
*输出参数：无
*返回参数：无 
*******************************************************************************/
void delay_ms(u32 time)
{
	u32 i;
	for (i=0; i<time; i++)
	{
		delay_us(1000);
    }
}

/******************* (C) COPYRIGHT 2016  *****END OF FILE**********************/

